Revit 2027 API
BuiltInFailures.GeometryFailures.CurveDriverError Property
 Element's internal join data is corrupt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveDriverError { get; }
Public Shared ReadOnly Property CurveDriverError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveDriverError {
	FailureDefinitionId^ get ();
}
static member CurveDriverError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace